python_gil.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-09 Thu 19:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GIL в Python</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="python" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">GIL в Python</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga87d831">1. Потоки в Python</a></li>
<li><a href="#org085a870">2. Структуры интерпретатора, обеспечивающие многопоточную работу</a></li>
<li><a href="#org5f6e839">3. GIL</a>
<ul>
<li><a href="#org4c7d827">3.1. Старый GIL: 2.x и 3.0/3.1</a></li>
<li><a href="#org6a62848">3.2. Новый GIL</a></li>
</ul>
</li>
<li><a href="#org71e468f">4. GIL и системный вызовы</a></li>
</ul>
</div>
</div>


<div id="outline-container-orga87d831" class="outline-2">
<h2 id="orga87d831"><span class="section-number-2">1</span> Потоки в Python</h2>
<div class="outline-text-2" id="text-1">
<p>
Python threads — это настоящие потоки (POSIX threads или Windows threads), полностью контролируемые ОС. Рассмотрим поточное выполнение в процессе интерпретатора Python (CPython, написанного на C):
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> time
<span style="color: #00ff00; font-weight: bold;">import</span> threading

<span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">CountdownThread</span>(threading.Thread):
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__init__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>, count):
        threading.Thread.__init__(<span style="color: #00ff00; font-weight: bold;">self</span>)
        <span style="color: #00ff00; font-weight: bold;">self</span>.count = count
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">run</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">while</span> <span style="color: #00ff00; font-weight: bold;">self</span>.count &gt; 0:
            <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"Counting down"</span>, <span style="color: #00ff00; font-weight: bold;">self</span>.count)
            <span style="color: #00ff00; font-weight: bold;">self</span>.count -= 1
            time.sleep(2)
        <span style="color: #00ff00; font-weight: bold;">return</span>
</pre>
</div>
<p>
Многопоточная программа на <i>C</i> не должна как-то отдельно регистрировать свои потоки — достаточно вызова API (pthread_create или CreateThread) для запуска потока. Интерпретатор Python для своей работы требует ряда структур.
</p>
</div>
</div>

<div id="outline-container-org085a870" class="outline-2">
<h2 id="org085a870"><span class="section-number-2">2</span> Структуры интерпретатора, обеспечивающие многопоточную работу</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt>PyInterpreterState</dt><dd>содержит глобальное состояние интерпретатора: загруженные модули <i>modules</i>, указатель на первый (главный) поток <i>tstate_head</i> и разное другое:</dd>
</dl>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">PyInterpreterState</span> {
    <span style="color: #00ffff;">PyIterpreterState</span> *<span style="color: #ffffff;">next</span>;
    <span style="color: #00ffff;">PyThreadState</span> *<span style="color: #ffffff;">tstate_head</span>;

    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">modules</span>;
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">sysdict</span>;
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">builtins</span>;
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">modules_reloading</span>;

    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">codec_search_path</span>;
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">codec_search_cache</span>;
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">codec_error_registry</span>;
};
</pre>
</div>

<dl class="org-dl">
<dt>PyThreadState</dt><dd>позволяет узнать какой кадр стека (frame) исполняется и какой номер у потока с точки зрения операционной системы.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">PyThreadState</span> {
    <span style="color: #00ffff;">PyThreadState</span> *<span style="color: #ffffff;">next</span>;
    <span style="color: #00ffff;">PyInterpreterState</span> *<span style="color: #ffffff;">interp</span>;

    <span style="color: #00ffff;">PyFrameObject</span> *<span style="color: #ffffff;">frame</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">recursion_depth</span>;

    <span style="color: #00ffff;">Py_tracefunc</span> <span style="color: #ffffff;">c_profilefunc</span>;
    <span style="color: #00ffff;">Py_tracefunc</span> <span style="color: #ffffff;">c_tracefunc</span>;
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">c_profileobj</span>;
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">c_traceobj</span>;

    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">exc_type</span>;
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">exc_value</span>;
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">exc_traceback</span>;

    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">dict</span>;             <span style="color: #5F7F5F;">/* </span><span style="color: #ffa500; font-style: italic;">Stores per-thread state </span><span style="color: #5F7F5F;">*/</span>

    <span style="color: #00ffff;">long</span> <span style="color: #ffffff;">thread_id</span>;
};
</pre>
</div>

<dl class="org-dl">
<dt>PyFrameObject</dt><dd>это объект кадра стека. Имеет указатель на предыдущий кадр <i>f_back</i>, исполняемый код <i>f_code</i> и последнюю выполненную в этом коде инструкцию <i>f_lasti</i>, указатель на свой поток <i>f_tstate</i> и серию из глобального, локального и встроенного пространства имён (<i>f_globals</i>, <i>f_locals</i>, <i>f_builtins</i>).</dd>
</dl>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">PyFrameObject</span> {
    PyObject_VAR_HEAD
    <span style="color: #00ffff;">PyFrameObject</span> *<span style="color: #ffffff;">f_back</span>;      <span style="color: #5F7F5F;">/* </span><span style="color: #ffa500; font-style: italic;">previous frame, or NULL </span><span style="color: #5F7F5F;">*/</span>
    <span style="color: #00ffff;">PyCodeObject</span> *<span style="color: #ffffff;">f_code</span>;       <span style="color: #5F7F5F;">/* </span><span style="color: #ffa500; font-style: italic;">code segment </span><span style="color: #5F7F5F;">*/</span>
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">f_builtins</span>;       <span style="color: #5F7F5F;">/* </span><span style="color: #ffa500; font-style: italic;">builtin symbol table (PyDictObject) </span><span style="color: #5F7F5F;">*/</span>
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">f_globals</span>;        <span style="color: #5F7F5F;">/* </span><span style="color: #ffa500; font-style: italic;">global symbol table (PyDictObject) </span><span style="color: #5F7F5F;">*/</span>
    <span style="color: #00ffff;">PyObject</span> *<span style="color: #ffffff;">f_locals</span>;         <span style="color: #5F7F5F;">/* </span><span style="color: #ffa500; font-style: italic;">local symbol table (any mapping) </span><span style="color: #5F7F5F;">*/</span>

    <span style="color: #00ffff;">PyThreadState</span> *<span style="color: #ffffff;">f_state</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">f_lasti</span>;                <span style="color: #5F7F5F;">/* </span><span style="color: #ffa500; font-style: italic;">Last instruction if called </span><span style="color: #5F7F5F;">*/</span>
};
</pre>
</div>

<p>
Важно понимать, что все три необходимых для исполнения структуры взаимно связаны между собой и <i>PyThreadState_GET()</i> возвращает указатель на текущий работающий поток.
</p>
</div>
</div>

<div id="outline-container-org5f6e839" class="outline-2">
<h2 id="org5f6e839"><span class="section-number-2">3</span> GIL</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4c7d827" class="outline-3">
<h3 id="org4c7d827"><span class="section-number-3">3.1</span> Старый GIL: 2.x и 3.0/3.1</h3>
<div class="outline-text-3" id="text-3-1">
<p>
GIL переключается каждые 100 инструкций (или на IO операциях). Сам GIL устроен как нерекурсиваная блокировка. Только что освободивший GIL поток скорее всего обратно сразу же его не получит (если алгоритм переключения потоков в ОС "справедливо" распределяет время работы потоков), а отдаст управление другому потоку и сам встанет в ожидание. Проблемы GIL:
</p>
<ul class="org-ul">
<li>GIL переключается даже в однопоточной программе. Формально, <i>interpreter_lock</i> создаётся не сразу при старте интерпретатора. Но импорт модуля <i>threading</i> или <i>sqlite3</i> создаст GIL даже без создания второго потока. На практике правильней считать, что GIL есть всегда.</li>
<li>GIL переключается постоянно, независимо от того требует ли другой поток переключения или они все заблокированы ожиданием ввода-вывода или объектами синхронизации.</li>
<li>Потоки соревнуются за захват GIL. Например, потоки, интенсивно использующие IO, получают более высокий приоритет чем чисто вычислительные. Это может негативно сказываться на производительности не-IO потоков.</li>
<li>Переключение происходит по количеству выполненых инструкций интерпретатора Python. Время инструкций может сильно отличаться: простое сложение или создание списка на миллион элементов.</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> sys

<span style="color: #ffffff;">i</span> = sys.getcheckinterval()
sys.setcheckinterval(i)
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"check interval is: %d"</span> % i)
</pre>
</div>

<pre class="example">
check interval is: 100

</pre>

<p>
В силу слабой связности интервала переключения со временем исполнения эти функции практически бесполезны.
</p>
</div>
</div>

<div id="outline-container-org6a62848" class="outline-3">
<h3 id="org6a62848"><span class="section-number-3">3.2</span> Новый GIL</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Использует усовершенствованную схему, базирующуюся на времени. Кроме того, добавлен специальный механизм для предотвращения повторного захвата GIL.
</p>
<ul class="org-ul">
<li>Поток, владеющий GIL, не отдаст его пока его об этом не попросят.</li>
<li>Если уж отдал по просьбе, то подождёт окончания переключения и не будет сразу же пытаться захватить GIL назад.</li>
<li>Поток, у которого не получилось захватить GIL, сначала выждет 5мс и лишь потом пошлёт запрос на переключение, принуждая текущего владельца освободить ресурс. Таким образом, переключение происходит не чаще чем раз в 5мс, если только владелец не отдаст GIL добровольно перед выполнением системного вызова.</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> sys

<span style="color: #00ff00; font-weight: bold;">print</span>(sys.getswitchinterval())
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">sys.steswitchinterval(i)</span>
</pre>
</div>

<pre class="example">
0.005

</pre>
</div>
</div>
</div>

<div id="outline-container-org71e468f" class="outline-2">
<h2 id="org71e468f"><span class="section-number-2">4</span> GIL и системный вызовы</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-11-09 Thu 19:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
